src/cf/BusinessProcesses/ЗаявкаНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаИзменение</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаИзменение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммныеПродукты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеОбращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техлид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыеТрудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/Enums/СтатусыЗаявкиНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявкиНаИзменение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бэклог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналитическаяПроработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаТрудозатрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеДоработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаНеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаНеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеЗапросаНаСлияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаКода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРаботЗаказчику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/BusinessProcesses/ЗаявкаНаИзменение/Ext/ManagerModule.bsl
Функция ДоступныеСтатусы(ТекущийСтатус) Экспорт
	ДоступныеСтатусы = Новый Массив;
	Если НЕ ЗначениеЗаполнено(ТекущийСтатус) Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.Бэклог);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.Бэклог Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.АналитическаяПроработка);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.АналитическаяПроработка Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ДоработкаНеТребуется);
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ОценкаТрудозатрат);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.ОценкаТрудозатрат Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.СогласованиеДоработки);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.СогласованиеДоработки Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ДоработкаНеСогласована);
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.Тестирование);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.Тестирование Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке);
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.СозданиеЗапросаНаСлияние);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.СозданиеЗапросаНаСлияние Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ПроверкаКода);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.ПроверкаКода Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.ВРазработке);
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.СдачаРаботЗаказчику);
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыЗаявкиНаИзменение.СдачаРаботЗаказчику Тогда
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыЗаявкиНаИзменение.Закрыта);
	КонецЕсли;
	
	Возврат ДоступныеСтатусы;
КонецФункции
